PLAN FOR: deployments/apiv2/terraform <br /> module.mantarray.aws_s3_bucket.main_firmware_bucket: Refreshing state... [id=prod-main-firmware]
module.users.aws_ecr_repository.users_ecr_repo: Refreshing state... [id=users]
module.mantarray.aws_s3_bucket.logs_bucket: Refreshing state... [id=prod-mantarray-logs]
module.mantarray.aws_s3_bucket.channel_firmware_bucket: Refreshing state... [id=prod-channel-firmware]
module.mantarray.aws_ecr_repository.mantarray_ecr_repo: Refreshing state... [id=mantarray]
module.mantarray.aws_ecr_lifecycle_policy.mantarray_ecr_lifecycle_policy: Refreshing state... [id=mantarray]
module.users.aws_ecr_lifecycle_policy.users_ecr_lifecycle_policy: Refreshing state... [id=users]
module.mantarray.aws_s3_bucket_policy.logs_bucket: Refreshing state... [id=prod-mantarray-logs]
module.mantarray.aws_s3_bucket_policy.channel_firmware_bucket: Refreshing state... [id=prod-channel-firmware]
module.mantarray.aws_s3_bucket_ownership_controls.logs_bucket: Refreshing state... [id=prod-mantarray-logs]
module.mantarray.aws_s3_bucket_ownership_controls.channel_firmware_bucket: Refreshing state... [id=prod-channel-firmware]
module.mantarray.aws_s3_bucket_server_side_encryption_configuration.logs_bucket: Refreshing state... [id=prod-mantarray-logs]
module.mantarray.aws_s3_bucket_cors_configuration.channel_firmware_bucket: Refreshing state... [id=prod-channel-firmware]
module.mantarray.aws_s3_bucket_server_side_encryption_configuration.channel_firmware_bucket: Refreshing state... [id=prod-channel-firmware]
module.mantarray.aws_s3_bucket_server_side_encryption_configuration.main_firmware_bucket: Refreshing state... [id=prod-main-firmware]
module.mantarray.aws_s3_bucket_cors_configuration.main_firmware_bucket: Refreshing state... [id=prod-main-firmware]
module.mantarray.aws_s3_bucket_policy.main_firmware_bucket: Refreshing state... [id=prod-main-firmware]
module.mantarray.aws_s3_bucket_ownership_controls.main_firmware_bucket: Refreshing state... [id=prod-main-firmware]
module.mantarray.aws_s3_bucket_acl.channel_firmware_bucket: Refreshing state... [id=prod-channel-firmware,private]
module.mantarray.aws_s3_bucket_acl.logs_bucket: Refreshing state... [id=prod-mantarray-logs,private]
module.mantarray.aws_s3_bucket_acl.main_firmware_bucket: Refreshing state... [id=prod-main-firmware,private]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.event_broker.aws_ecr_lifecycle_policy.event_broker_ecr_lifecycle_policy will be created
  + resource "aws_ecr_lifecycle_policy" "event_broker_ecr_lifecycle_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 3 tagged images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 3
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "0",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep only 1 untagged image"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber = 1
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "event-broker"
    }

  # module.event_broker.aws_ecr_repository.event_broker_ecr_repo will be created
  + resource "aws_ecr_repository" "event_broker_ecr_repo" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "event-broker"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + event_broker_ecr_repo = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.